<?php
    /**
     * メインクエりに関連する設定群 
     */

    
    /*
    =====================================================================
    =====================================================================
    メインクエリ
    =====================================================================
    =====================================================================
    */

    // function changeMainQuery($query)
    // {
    // 	//管理画面のメインクエリーとメインクエリーじゃないときは処理しない
    // 	if (is_admin() || !$query->is_main_query()) {
    // 		return;
    // 	}
        
    // 	//トップには投稿タイプニュースを表示する
    // 	if ($query->is_home()) {
    // 		$query->set( 'post_type', 'news' );
    // 	}
        
    // 	//カスタム投稿タイプのメインクエリを変更する
    // 	if ($query->is_post_type_archive("news")) {
    // 		$query->set( 'posts_per_page' , 10 );
    // 	}
    // }
    // add_action('pre_get_posts', 'changeMainQuery');